app/Http/Controllers/ControlController.php

    public function index()
    {
        $controles = Control::all();
---
select * from `controls`