app/Http/Controllers/EstadisticaController.php

        $ercII = $all->ercII()->count();
        $ercIIM = $all->ercII()->where('sexo', 'Masculino')->count();
        $ercIIOriginM = $all->ercII()->where('pacientes.sexo', '=', 'masculino')->where('pueblo_originario', '=', 1)->count();
        $ercII_1519M = $all->ercII()->get()->whereBetween('grupo', [15, 19])->where('sexo', 'Masculino')->count();
        $ercII_2024M = $all->ercII()->get()->whereBetween('grupo', [20, 24])->where('sexo', 'Masculino')->count();
---
select count(*) as aggregate from `pacientes` where `riesgo_cv` in ('ALTO', 'BAJO', 'MODERADO') and `erc` = 'IIIA' and `Sexo` = 'Femenino'
select count(*) as aggregate from `pacientes` where `riesgo_cv` in ('ALTO', 'BAJO', 'MODERADO') and `erc` = 'IIIA' and `pacientes`.`sexo` = 'femenino' and `pueblo_originario` = 1

        $ercIIF = $all->ercII()->where('sexo', 'Femenino')->count();
        $ercIIOriginF = $all->ercII()->where('pacientes.sexo', '=', 'femenino')->where('pueblo_originario', '=', 1)->count();
        $ercII_1519F = $all->ercII()->get()->whereBetween('grupo', [15, 19])->where('sexo', 'Femenino')->count();
        $ercII_2024F = $all->ercII()->get()->whereBetween('grupo', [20, 24])->where('sexo', 'Femenino')->count();
---
select count(*) as aggregate from `pacientes` where `riesgo_cv` in ('ALTO', 'BAJO', 'MODERADO') and `erc` = 'IIIB' and `sexo` = 'Masculino'

        $ercIIIa = $all->ercIIIa()->count();
        $ercIIIaM = $all->ercIIIa()->where('sexo', 'Masculino')->count();
        $ercIIIaOriginM = $all->ercIIIa()->where('pacientes.sexo', '=', 'masculino')->where('pueblo_originario', '=', 1)->count();
        $ercIIIa_1519M = $all->ercIIIa()->get()->whereBetween('grupo', [15, 19])->where('sexo', 'Masculino')->count();
---
select count(*) as aggregate from `pacientes` where `riesgo_cv` in ('ALTO', 'BAJO', 'MODERADO') and `erc` = 'IIIB' and `pacientes`.`sexo` = 'femenino' and `pueblo_originario` = 1


        $ercIIIaF = $all->ercIIIa()->where('Sexo', 'Femenino')->count();
        $ercIIIaOriginF = $all->ercIIIa()->where('pacientes.sexo', '=', 'femenino')->where('pueblo_originario', '=', 1)->count();
        $ercIIIa_1519F = $all->ercIIIa()->get()->whereBetween('grupo', [15, 19])->where('sexo', 'Femenino')->count();
        $ercIIIa_2024F = $all->ercIIIa()->get()->whereBetween('grupo', [20, 24])->where('sexo', 'Femenino')->count();
---
select count(*) as aggregate from `pacientes` where `riesgo_cv` in ('ALTO', 'BAJO', 'MODERADO') and `erc` = 'IV' and `sexo` = 'Masculino'
select count(*) as aggregate from `pacientes` where `riesgo_cv` in ('ALTO', 'BAJO', 'MODERADO') and `erc` = 'IV' and `pacientes`.`sexo` = 'masculino' and `pueblo_originario` = 1

        $ercIIIb = $all->ercIIIb()->count();
        $ercIIIbM = $all->ercIIIb()->where('sexo', 'Masculino')->count();
        $ercIIIbOriginM = $all->ercIIIb()->where('pacientes.sexo', '=', 'masculino')->where('pueblo_originario', '=', 1)->count();
        $ercIIIb_1519M = $all->ercIIIb()->get()->whereBetween('grupo', [15, 19])->where('sexo', 'Masculino')->count();
---
select count(*) as aggregate from `pacientes` where `riesgo_cv` in ('ALTO', 'BAJO', 'MODERADO') and `erc` = 'IV' and `pacientes`.`sexo` = 'femenino' and `pueblo_originario` = 1


        $ercIIIbF = $all->pscv()->where('erc', 'IIIB')->where('sexo', 'Femenino')->count();
        $ercIIIbOriginF = $all->ercIIIb()->where('pacientes.sexo', '=', 'femenino')->where('pueblo_originario', '=', 1)->count();
        $ercIIIb_1519F = $all->ercIIIb()->get()->whereBetween('grupo', [15, 19])->where('sexo', 'Femenino')->count();
        $ercIIIb_2024F = $all->ercIIIb()->get()->whereBetween('grupo', [20, 24])->where('sexo', 'Femenino')->count();
---
select count(*) as aggregate from `pacientes` where `riesgo_cv` in ('ALTO', 'BAJO', 'MODERADO') and `erc` = 'V' and `sexo` = 'Masculino'
select count(*) as aggregate from `pacientes` where `riesgo_cv` in ('ALTO', 'BAJO', 'MODERADO') and `erc` = 'V' and `pacientes`.`sexo` = 'masculino' and `pueblo_originario` = 1

        $ercIV = $all->ercIV()->count();
        $ercIVM = $all->ercIV()->where('sexo', 'Masculino')->count();
        $ercIVOriginM = $all->ercIV()->where('pacientes.sexo', '=', 'masculino')->where('pueblo_originario', '=', 1)->count();
        $ercIV_1519M = $all->ercIV()->get()->whereBetween('grupo', [15, 19])->where('sexo', 'Masculino')->count();
---
select count(*) as aggregate from `pacientes` where `riesgo_cv` in ('ALTO', 'BAJO', 'MODERADO') and `erc` = 'V' and `pacientes`.`sexo` = 'femenino' and `pueblo_originario` = 1


        $ercAllF = $all->ercTotal()->where('sexo', 'Femenino')->count();
        $ercAllOriginF = $all->ercTotal()->where('pacientes.sexo', '=', 'femenino')->where('pueblo_originario', '=', 1)->count();
        $ercAll_1519F = $all->ercTotal()->get()->whereBetween('grupo', [15, 19])->where('sexo', 'Femenino')->count();
---
select count(*) as aggregate from `pacientes` where `riesgo_cv` = 'MODERADO' and `pacientes`.`sexo` = 'masculino' and `pueblo_originario` = 1