app/Http/Controllers/PacienteController.php

    public function show($id)
    {
        $paciente = Paciente::findOrFail($id);
        $patologias = Patologia::all();
        $controles = $paciente->controls()->latest('fecha_control')->get();
---
select * from `controls` where `controls`.`paciente_id` = 1418 and `controls`.`paciente_id` is not null order by `fecha_control` desc